; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-4-3-8)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	p0-6 - location
	p2-6 - location
	p3-4 - location
	p3-5 - location
	p3-7 - location
	p3-8 - location
	p4-5 - location
	p4-7 - location
	p5-0 - location
	p5-1 - location
	p5-2 - location
	p6-3 - location
	p6-5 - location
	p8-2 - location
	p8-7 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s0)
	(at driver3 s2)
	(at driver4 s4)
	(at truck1 s3)
	(empty truck1)
	(at truck2 s5)
	(empty truck2)
	(at truck3 s0)
	(empty truck3)
	(at package1 s3)
	(at package2 s5)
	(at package3 s6)
	(at package4 s2)
	(at package5 s5)
	(at package6 s0)
	(at package7 s8)
	(at package8 s8)
	(path s0 p0-6)
	(path p0-6 s0)
	(path s6 p0-6)
	(path p0-6 s6)
	(= (time-to-walk s0 p0-6) 63)
	(= (time-to-walk p0-6 s0) 63)
	(= (time-to-walk s6 p0-6) 65)
	(= (time-to-walk p0-6 s6) 65)
	(path s2 p2-6)
	(path p2-6 s2)
	(path s6 p2-6)
	(path p2-6 s6)
	(= (time-to-walk s2 p2-6) 95)
	(= (time-to-walk p2-6 s2) 95)
	(= (time-to-walk s6 p2-6) 67)
	(= (time-to-walk p2-6 s6) 67)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(= (time-to-walk s3 p3-4) 68)
	(= (time-to-walk p3-4 s3) 68)
	(= (time-to-walk s4 p3-4) 63)
	(= (time-to-walk p3-4 s4) 63)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(= (time-to-walk s3 p3-5) 34)
	(= (time-to-walk p3-5 s3) 34)
	(= (time-to-walk s5 p3-5) 2)
	(= (time-to-walk p3-5 s5) 2)
	(path s3 p3-7)
	(path p3-7 s3)
	(path s7 p3-7)
	(path p3-7 s7)
	(= (time-to-walk s3 p3-7) 91)
	(= (time-to-walk p3-7 s3) 91)
	(= (time-to-walk s7 p3-7) 36)
	(= (time-to-walk p3-7 s7) 36)
	(path s3 p3-8)
	(path p3-8 s3)
	(path s8 p3-8)
	(path p3-8 s8)
	(= (time-to-walk s3 p3-8) 63)
	(= (time-to-walk p3-8 s3) 63)
	(= (time-to-walk s8 p3-8) 68)
	(= (time-to-walk p3-8 s8) 68)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(= (time-to-walk s4 p4-5) 14)
	(= (time-to-walk p4-5 s4) 14)
	(= (time-to-walk s5 p4-5) 30)
	(= (time-to-walk p4-5 s5) 30)
	(path s4 p4-7)
	(path p4-7 s4)
	(path s7 p4-7)
	(path p4-7 s7)
	(= (time-to-walk s4 p4-7) 27)
	(= (time-to-walk p4-7 s4) 27)
	(= (time-to-walk s7 p4-7) 69)
	(= (time-to-walk p4-7 s7) 69)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(= (time-to-walk s5 p5-0) 54)
	(= (time-to-walk p5-0 s5) 54)
	(= (time-to-walk s0 p5-0) 3)
	(= (time-to-walk p5-0 s0) 3)
	(path s5 p5-1)
	(path p5-1 s5)
	(path s1 p5-1)
	(path p5-1 s1)
	(= (time-to-walk s5 p5-1) 73)
	(= (time-to-walk p5-1 s5) 73)
	(= (time-to-walk s1 p5-1) 19)
	(= (time-to-walk p5-1 s1) 19)
	(path s5 p5-2)
	(path p5-2 s5)
	(path s2 p5-2)
	(path p5-2 s2)
	(= (time-to-walk s5 p5-2) 87)
	(= (time-to-walk p5-2 s5) 87)
	(= (time-to-walk s2 p5-2) 28)
	(= (time-to-walk p5-2 s2) 28)
	(path s6 p6-3)
	(path p6-3 s6)
	(path s3 p6-3)
	(path p6-3 s3)
	(= (time-to-walk s6 p6-3) 20)
	(= (time-to-walk p6-3 s6) 20)
	(= (time-to-walk s3 p6-3) 4)
	(= (time-to-walk p6-3 s3) 4)
	(path s6 p6-5)
	(path p6-5 s6)
	(path s5 p6-5)
	(path p6-5 s5)
	(= (time-to-walk s6 p6-5) 9)
	(= (time-to-walk p6-5 s6) 9)
	(= (time-to-walk s5 p6-5) 16)
	(= (time-to-walk p6-5 s5) 16)
	(path s8 p8-2)
	(path p8-2 s8)
	(path s2 p8-2)
	(path p8-2 s2)
	(= (time-to-walk s8 p8-2) 74)
	(= (time-to-walk p8-2 s8) 74)
	(= (time-to-walk s2 p8-2) 84)
	(= (time-to-walk p8-2 s2) 84)
	(path s8 p8-7)
	(path p8-7 s8)
	(path s7 p8-7)
	(path p8-7 s7)
	(= (time-to-walk s8 p8-7) 10)
	(= (time-to-walk p8-7 s8) 10)
	(= (time-to-walk s7 p8-7) 83)
	(= (time-to-walk p8-7 s7) 83)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 33)
	(= (time-to-drive s1 s0) 33)
	(link s0 s7)
	(link s7 s0)
	(= (time-to-drive s0 s7) 72)
	(= (time-to-drive s7 s0) 72)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 48)
	(= (time-to-drive s2 s1) 48)
	(link s1 s5)
	(link s5 s1)
	(= (time-to-drive s1 s5) 27)
	(= (time-to-drive s5 s1) 27)
	(link s1 s6)
	(link s6 s1)
	(= (time-to-drive s1 s6) 39)
	(= (time-to-drive s6 s1) 39)
	(link s1 s7)
	(link s7 s1)
	(= (time-to-drive s1 s7) 15)
	(= (time-to-drive s7 s1) 15)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 90)
	(= (time-to-drive s0 s2) 90)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 72)
	(= (time-to-drive s4 s2) 72)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 16)
	(= (time-to-drive s5 s2) 16)
	(link s2 s7)
	(link s7 s2)
	(= (time-to-drive s2 s7) 80)
	(= (time-to-drive s7 s2) 80)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 8)
	(= (time-to-drive s2 s3) 8)
	(link s3 s6)
	(link s6 s3)
	(= (time-to-drive s3 s6) 78)
	(= (time-to-drive s6 s3) 78)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 48)
	(= (time-to-drive s0 s4) 48)
	(link s4 s3)
	(link s3 s4)
	(= (time-to-drive s4 s3) 21)
	(= (time-to-drive s3 s4) 21)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 8)
	(= (time-to-drive s5 s4) 8)
	(link s4 s6)
	(link s6 s4)
	(= (time-to-drive s4 s6) 74)
	(= (time-to-drive s6 s4) 74)
	(link s5 s0)
	(link s0 s5)
	(= (time-to-drive s5 s0) 90)
	(= (time-to-drive s0 s5) 90)
	(link s6 s5)
	(link s5 s6)
	(= (time-to-drive s6 s5) 61)
	(= (time-to-drive s5 s6) 61)
	(link s6 s7)
	(link s7 s6)
	(= (time-to-drive s6 s7) 77)
	(= (time-to-drive s7 s6) 77)
	(link s6 s8)
	(link s8 s6)
	(= (time-to-drive s6 s8) 62)
	(= (time-to-drive s8 s6) 62)
	(link s7 s3)
	(link s3 s7)
	(= (time-to-drive s7 s3) 80)
	(= (time-to-drive s3 s7) 80)
	(link s8 s0)
	(link s0 s8)
	(= (time-to-drive s8 s0) 64)
	(= (time-to-drive s0 s8) 64)
	(link s8 s3)
	(link s3 s8)
	(= (time-to-drive s8 s3) 90)
	(= (time-to-drive s3 s8) 90)
	(link s8 s5)
	(link s5 s8)
	(= (time-to-drive s8 s5) 99)
	(= (time-to-drive s5 s8) 99)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s4)
	(at driver2 s4)
	(at driver3 s2)
	(at driver4 s8)
	(at truck1 s6)
	(at truck3 s6)
	(at package2 s6)
	(at package3 s5)
	(at package5 s7)
	(at package6 s1)
	(at package7 s6)
	(at package8 s0)
	))

(:metric minimize (+ (+ (* 3  (total-time)) (* 4  (driven))) (* 1  (walked))))

)

; plan
1. (board-truck driver2 truck3 s0)
   deleted: (at driver2 s0) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 1 of 12
2. (load-truck package6 truck3 s0)
   deleted: (at package6 s0)
   added: (in package6 truck3)
   goals met: 1 of 12
3. (walk driver4 s4 p3-4)
   deleted: (at driver4 s4)
   added: (at driver4 p3-4)
   changed: (walked) from 0 to 63
   goals met: 1 of 12
4. (drive-truck truck3 s0 s1 driver2)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   changed: (driven) from 0 to 33
   goals met: 1 of 12
5. (unload-truck package6 truck3 s1)
   deleted: (in package6 truck3)
   added: (at package6 s1)
   goals met: 2 of 12
6. (drive-truck truck3 s1 s6 driver2)
   deleted: (at truck3 s1)
   added: (at truck3 s6)
   changed: (driven) from 33 to 72
   goals met: 3 of 12
7. (walk driver4 p3-4 s3)
   deleted: (at driver4 p3-4)
   added: (at driver4 s3)
   changed: (walked) from 63 to 131
   goals met: 3 of 12
8. (board-truck driver4 truck1 s3)
   deleted: (at driver4 s3) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 3 of 12
9. (drive-truck truck1 s3 s8 driver4)
   deleted: (at truck1 s3)
   added: (at truck1 s8)
   changed: (driven) from 72 to 162
   goals met: 3 of 12
10. (load-truck package3 truck3 s6)
   deleted: (at package3 s6)
   added: (in package3 truck3)
   goals met: 3 of 12
11. (load-truck package7 truck1 s8)
   deleted: (at package7 s8)
   added: (in package7 truck1)
   goals met: 3 of 12
12. (drive-truck truck3 s6 s5 driver2)
   deleted: (at truck3 s6)
   added: (at truck3 s5)
   changed: (driven) from 162 to 223
   goals met: 2 of 12
13. (unload-truck package3 truck3 s5)
   deleted: (in package3 truck3)
   added: (at package3 s5)
   goals met: 3 of 12
14. (load-truck package2 truck3 s5)
   deleted: (at package2 s5)
   added: (in package2 truck3)
   goals met: 3 of 12
15. (load-truck package5 truck3 s5)
   deleted: (at package5 s5)
   added: (in package5 truck3)
   goals met: 3 of 12
16. (drive-truck truck3 s5 s6 driver2)
   deleted: (at truck3 s5)
   added: (at truck3 s6)
   changed: (driven) from 223 to 284
   goals met: 4 of 12
17. (unload-truck package2 truck3 s6)
   deleted: (in package2 truck3)
   added: (at package2 s6)
   goals met: 5 of 12
18. (load-truck package8 truck1 s8)
   deleted: (at package8 s8)
   added: (in package8 truck1)
   goals met: 5 of 12
19. (drive-truck truck3 s6 s1 driver2)
   deleted: (at truck3 s6)
   added: (at truck3 s1)
   changed: (driven) from 284 to 323
   goals met: 4 of 12
20. (drive-truck truck1 s8 s0 driver4)
   deleted: (at truck1 s8)
   added: (at truck1 s0)
   changed: (driven) from 323 to 387
   goals met: 4 of 12
21. (unload-truck package8 truck1 s0)
   deleted: (in package8 truck1)
   added: (at package8 s0)
   goals met: 5 of 12
22. (drive-truck truck1 s0 s8 driver4)
   deleted: (at truck1 s0)
   added: (at truck1 s8)
   changed: (driven) from 387 to 451
   goals met: 5 of 12
23. (drive-truck truck1 s8 s6 driver4)
   deleted: (at truck1 s8)
   added: (at truck1 s6)
   changed: (driven) from 451 to 513
   goals met: 6 of 12
24. (unload-truck package7 truck1 s6)
   deleted: (in package7 truck1)
   added: (at package7 s6)
   goals met: 7 of 12
25. (drive-truck truck3 s1 s6 driver2)
   deleted: (at truck3 s1)
   added: (at truck3 s6)
   changed: (driven) from 513 to 552
   goals met: 8 of 12
26. (drive-truck truck1 s6 s8 driver4)
   deleted: (at truck1 s6)
   added: (at truck1 s8)
   changed: (driven) from 552 to 614
   goals met: 7 of 12
27. (disembark-truck driver4 truck1 s8)
   deleted: (driving driver4 truck1)
   added: (at driver4 s8) (empty truck1)
   goals met: 8 of 12
28. (disembark-truck driver2 truck3 s6)
   deleted: (driving driver2 truck3)
   added: (at driver2 s6) (empty truck3)
   goals met: 8 of 12
29. (walk driver1 s1 p5-1)
   deleted: (at driver1 s1)
   added: (at driver1 p5-1)
   changed: (walked) from 131 to 150
   goals met: 8 of 12
30. (walk driver1 p5-1 s5)
   deleted: (at driver1 p5-1)
   added: (at driver1 s5)
   changed: (walked) from 150 to 223
   goals met: 8 of 12
31. (walk driver1 s5 p4-5)
   deleted: (at driver1 s5)
   added: (at driver1 p4-5)
   changed: (walked) from 223 to 253
   goals met: 8 of 12
32. (walk driver1 p4-5 s4)
   deleted: (at driver1 p4-5)
   added: (at driver1 s4)
   changed: (walked) from 253 to 267
   goals met: 9 of 12
33. (board-truck driver2 truck3 s6)
   deleted: (at driver2 s6) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 9 of 12
34. (drive-truck truck3 s6 s7 driver2)
   deleted: (at truck3 s6)
   added: (at truck3 s7)
   changed: (driven) from 614 to 691
   goals met: 8 of 12
35. (disembark-truck driver2 truck3 s7)
   deleted: (driving driver2 truck3)
   added: (at driver2 s7) (empty truck3)
   goals met: 8 of 12
36. (board-truck driver4 truck1 s8)
   deleted: (at driver4 s8) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 7 of 12
37. (drive-truck truck1 s8 s6 driver4)
   deleted: (at truck1 s8)
   added: (at truck1 s6)
   changed: (driven) from 691 to 753
   goals met: 8 of 12
38. (walk driver2 s7 p4-7)
   deleted: (at driver2 s7)
   added: (at driver2 p4-7)
   changed: (walked) from 267 to 336
   goals met: 8 of 12
39. (walk driver2 p4-7 s4)
   deleted: (at driver2 p4-7)
   added: (at driver2 s4)
   changed: (walked) from 336 to 363
   goals met: 9 of 12
40. (drive-truck truck1 s6 s7 driver4)
   deleted: (at truck1 s6)
   added: (at truck1 s7)
   changed: (driven) from 753 to 830
   goals met: 8 of 12
41. (disembark-truck driver4 truck1 s7)
   deleted: (driving driver4 truck1)
   added: (at driver4 s7) (empty truck1)
   goals met: 8 of 12
42. (board-truck driver4 truck3 s7)
   deleted: (at driver4 s7) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 8 of 12
43. (drive-truck truck3 s7 s6 driver4)
   deleted: (at truck3 s7)
   added: (at truck3 s6)
   changed: (driven) from 830 to 907
   goals met: 9 of 12
44. (walk driver2 s4 p4-7)
   deleted: (at driver2 s4)
   added: (at driver2 p4-7)
   changed: (walked) from 363 to 390
   goals met: 8 of 12
45. (drive-truck truck3 s6 s7 driver4)
   deleted: (at truck3 s6)
   added: (at truck3 s7)
   changed: (driven) from 907 to 984
   goals met: 7 of 12
46. (disembark-truck driver4 truck3 s7)
   deleted: (driving driver4 truck3)
   added: (at driver4 s7) (empty truck3)
   goals met: 7 of 12
47. (walk driver4 s7 p8-7)
   deleted: (at driver4 s7)
   added: (at driver4 p8-7)
   changed: (walked) from 390 to 473
   goals met: 7 of 12
48. (walk driver4 p8-7 s8)
   deleted: (at driver4 p8-7)
   added: (at driver4 s8)
   changed: (walked) from 473 to 483
   goals met: 8 of 12
49. (walk driver2 p4-7 s7)
   deleted: (at driver2 p4-7)
   added: (at driver2 s7)
   changed: (walked) from 483 to 552
   goals met: 8 of 12
50. (board-truck driver2 truck3 s7)
   deleted: (at driver2 s7) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 8 of 12
51. (drive-truck truck3 s7 s6 driver2)
   deleted: (at truck3 s7)
   added: (at truck3 s6)
   changed: (driven) from 984 to 1061
   goals met: 9 of 12
52. (walk driver1 s4 p4-7)
   deleted: (at driver1 s4)
   added: (at driver1 p4-7)
   changed: (walked) from 552 to 579
   goals met: 8 of 12
53. (drive-truck truck3 s6 s7 driver2)
   deleted: (at truck3 s6)
   added: (at truck3 s7)
   changed: (driven) from 1061 to 1138
   goals met: 7 of 12
54. (unload-truck package5 truck3 s7)
   deleted: (in package5 truck3)
   added: (at package5 s7)
   goals met: 8 of 12
55. (drive-truck truck3 s7 s0 driver2)
   deleted: (at truck3 s7)
   added: (at truck3 s0)
   changed: (driven) from 1138 to 1210
   goals met: 8 of 12
56. (walk driver1 p4-7 s4)
   deleted: (at driver1 p4-7)
   added: (at driver1 s4)
   changed: (walked) from 579 to 606
   goals met: 9 of 12
57. (walk driver4 s8 p8-7)
   deleted: (at driver4 s8)
   added: (at driver4 p8-7)
   changed: (walked) from 606 to 616
   goals met: 8 of 12
58. (walk driver4 p8-7 s7)
   deleted: (at driver4 p8-7)
   added: (at driver4 s7)
   changed: (walked) from 616 to 699
   goals met: 8 of 12
59. (drive-truck truck3 s0 s8 driver2)
   deleted: (at truck3 s0)
   added: (at truck3 s8)
   changed: (driven) from 1210 to 1274
   goals met: 8 of 12
60. (walk driver4 s7 p8-7)
   deleted: (at driver4 s7)
   added: (at driver4 p8-7)
   changed: (walked) from 699 to 782
   goals met: 8 of 12
61. (walk driver4 p8-7 s8)
   deleted: (at driver4 p8-7)
   added: (at driver4 s8)
   changed: (walked) from 782 to 792
   goals met: 9 of 12
62. (walk driver1 s4 p4-7)
   deleted: (at driver1 s4)
   added: (at driver1 p4-7)
   changed: (walked) from 792 to 819
   goals met: 8 of 12
63. (walk driver1 p4-7 s7)
   deleted: (at driver1 p4-7)
   added: (at driver1 s7)
   changed: (walked) from 819 to 888
   goals met: 8 of 12
64. (board-truck driver1 truck1 s7)
   deleted: (at driver1 s7) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 8 of 12
65. (drive-truck truck3 s8 s3 driver2)
   deleted: (at truck3 s8)
   added: (at truck3 s3)
   changed: (driven) from 1274 to 1364
   goals met: 8 of 12
66. (disembark-truck driver2 truck3 s3)
   deleted: (driving driver2 truck3)
   added: (at driver2 s3) (empty truck3)
   goals met: 8 of 12
67. (walk driver2 s3 p3-4)
   deleted: (at driver2 s3)
   added: (at driver2 p3-4)
   changed: (walked) from 888 to 956
   goals met: 8 of 12
68. (walk driver2 p3-4 s4)
   deleted: (at driver2 p3-4)
   added: (at driver2 s4)
   changed: (walked) from 956 to 1019
   goals met: 9 of 12
69. (drive-truck truck1 s7 s3 driver1)
   deleted: (at truck1 s7)
   added: (at truck1 s3)
   changed: (driven) from 1364 to 1444
   goals met: 9 of 12
70. (disembark-truck driver1 truck1 s3)
   deleted: (driving driver1 truck1)
   added: (at driver1 s3) (empty truck1)
   goals met: 9 of 12
71. (walk driver1 s3 p3-4)
   deleted: (at driver1 s3)
   added: (at driver1 p3-4)
   changed: (walked) from 1019 to 1087
   goals met: 9 of 12
72. (walk driver1 p3-4 s4)
   deleted: (at driver1 p3-4)
   added: (at driver1 s4)
   changed: (walked) from 1087 to 1150
   goals met: 10 of 12
73. (walk driver4 s8 p3-8)
   deleted: (at driver4 s8)
   added: (at driver4 p3-8)
   changed: (walked) from 1150 to 1218
   goals met: 9 of 12
74. (walk driver4 p3-8 s3)
   deleted: (at driver4 p3-8)
   added: (at driver4 s3)
   changed: (walked) from 1218 to 1281
   goals met: 9 of 12
75. (board-truck driver4 truck3 s3)
   deleted: (at driver4 s3) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 9 of 12
76. (drive-truck truck3 s3 s8 driver4)
   deleted: (at truck3 s3)
   added: (at truck3 s8)
   changed: (driven) from 1444 to 1534
   goals met: 9 of 12
77. (disembark-truck driver4 truck3 s8)
   deleted: (driving driver4 truck3)
   added: (at driver4 s8) (empty truck3)
   goals met: 10 of 12
78. (walk driver4 s8 p3-8)
   deleted: (at driver4 s8)
   added: (at driver4 p3-8)
   changed: (walked) from 1281 to 1349
   goals met: 9 of 12
79. (walk driver4 p3-8 s3)
   deleted: (at driver4 p3-8)
   added: (at driver4 s3)
   changed: (walked) from 1349 to 1412
   goals met: 9 of 12
80. (board-truck driver4 truck1 s3)
   deleted: (at driver4 s3) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 9 of 12
81. (walk driver3 s2 p8-2)
   deleted: (at driver3 s2)
   added: (at driver3 p8-2)
   changed: (walked) from 1412 to 1496
   goals met: 8 of 12
82. (walk driver3 p8-2 s8)
   deleted: (at driver3 p8-2)
   added: (at driver3 s8)
   changed: (walked) from 1496 to 1570
   goals met: 8 of 12
83. (board-truck driver3 truck3 s8)
   deleted: (at driver3 s8) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 8 of 12
84. (drive-truck truck1 s3 s2 driver4)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   changed: (driven) from 1534 to 1542
   goals met: 8 of 12
85. (drive-truck truck3 s8 s6 driver3)
   deleted: (at truck3 s8)
   added: (at truck3 s6)
   changed: (driven) from 1542 to 1604
   goals met: 9 of 12
86. (disembark-truck driver3 truck3 s6)
   deleted: (driving driver3 truck3)
   added: (at driver3 s6) (empty truck3)
   goals met: 9 of 12
87. (walk driver3 s6 p2-6)
   deleted: (at driver3 s6)
   added: (at driver3 p2-6)
   changed: (walked) from 1570 to 1637
   goals met: 9 of 12
88. (walk driver3 p2-6 s2)
   deleted: (at driver3 p2-6)
   added: (at driver3 s2)
   changed: (walked) from 1637 to 1732
   goals met: 10 of 12
89. (disembark-truck driver4 truck1 s2)
   deleted: (driving driver4 truck1)
   added: (at driver4 s2) (empty truck1)
   goals met: 10 of 12
90. (walk driver4 s2 p8-2)
   deleted: (at driver4 s2)
   added: (at driver4 p8-2)
   changed: (walked) from 1732 to 1816
   goals met: 10 of 12
91. (walk driver4 p8-2 s8)
   deleted: (at driver4 p8-2)
   added: (at driver4 s8)
   changed: (walked) from 1816 to 1890
   goals met: 11 of 12
92. (board-truck driver3 truck1 s2)
   deleted: (at driver3 s2) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 10 of 12
93. (drive-truck truck1 s2 s7 driver3)
   deleted: (at truck1 s2)
   added: (at truck1 s7)
   changed: (driven) from 1604 to 1684
   goals met: 10 of 12
94. (drive-truck truck1 s7 s6 driver3)
   deleted: (at truck1 s7)
   added: (at truck1 s6)
   changed: (driven) from 1684 to 1761
   goals met: 11 of 12
95. (disembark-truck driver3 truck1 s6)
   deleted: (driving driver3 truck1)
   added: (at driver3 s6) (empty truck1)
   goals met: 11 of 12
96. (walk driver3 s6 p2-6)
   deleted: (at driver3 s6)
   added: (at driver3 p2-6)
   changed: (walked) from 1890 to 1957
   goals met: 11 of 12
97. (walk driver3 p2-6 s2)
   deleted: (at driver3 p2-6)
   added: (at driver3 s2)
   changed: (walked) from 1957 to 2052
   goals met: 12 of 12
